saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKV58F24_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKV58F24_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKV58F24</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKV58F24" Dvendor="NXP:11">
      <description>The Kinetis® KV5x family of MCU is a high-performance solution offering exceptional precision, sensing and control targeting industrial motor control, industrial drives and automation and power conversion applications. The Kinetis KV5x MCU is built on the ARM® Cortex®-M7 core running at 240 MHz with single precision floating point unit. It features high-resolution pulse-width modulation (PWM) with 260 picosecond resolution, 4x 12-bit analog-to-digital converters (ADCs) sampling at 5 mega samples per second (MS/s), 3 FlexCAN modules, optional Ethernet communications and comprehensive enablement suite from NXP® and third-party resources including reference designs, software libraries and motor configuration tools.</description>
      <device Dname="MKV58F1M0xxx24">
        <processor Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="240000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV58F1M0xxx24_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" start="0x18000000" size="0x1000" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x10000000" size="0x100000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_DTC" start="0x20000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_ITC" start="0x00000000" size="0x010000" access="rw"/>
        <memory name="SRAM_OC" start="0x2f000000" size="0x010000" access="rw"/>
        <algorithm name="arm/MKV_P1024_8KB_SEC.FLM" start="0x10000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKV58F24.xml"/>
        <variant Dvariant="MKV58F1M0VLQ24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F1M0VLQ24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F1M0VLQ24/MKV58F1M0xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV58F1M0VLL24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F1M0VLL24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F1M0VLL24/MKV58F1M0xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV58F1M0VMD24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F1M0VMD24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F1M0VMD24/MKV58F1M0xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKV58F512xxx24">
        <processor Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="240000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV58F512xxx24_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" start="0x18000000" size="0x1000" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x10000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_DTC" start="0x20000000" size="0x010000" access="rw"/>
        <memory name="SRAM_ITC" start="0x00000000" size="0x010000" access="rw" default="1"/>
        <algorithm name="arm/MKV_P512_8KB_SEC.FLM" start="0x10000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKV58F24.xml"/>
        <variant Dvariant="MKV58F512VLQ24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F512VLQ24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F512VLQ24/MKV58F512xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV58F512VLL24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F512VLL24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F512VLL24/MKV58F512xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV58F512VMD24">
          <compile header="fsl_device_registers.h" define="CPU_MKV58F512VMD24"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV58F512VMD24/MKV58F512xxx24_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKV58F1M0???24" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
